cool/tutorials/multiphase/settlingFoam/tank3D/Allrun
#!/bin/sh
# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

application="settlingFoam"

#runApplication blockMesh
runApplication $application
